app/Controllers/Admin.php

    public function AllTransaksi()
    {
        $transaksi = $this->transaksiModel->findAll();
---
SELECT *
FROM `transaksi`