app/Controllers/Admin.php

UPDATE `transaksi` SET `status_pemesanan` = 'selesai'
WHERE `transaksi`.`id` IN ('1')
---
    public function confirm()
    {
        $idTransaksi = $this->request->getVar('idTransaksi');

        $this->transaksiModel->update($idTransaksi, ['status_pemesanan' => 'diproses']);

SELECT *
FROM `transaksi`
---
    public function AllTransaksi()
    {
        $transaksi = $this->transaksiModel->findAll();