app/Controllers/Keranjang.php

UPDATE `keranjang` SET `jumlah` = 1
WHERE `barang_id` = '26'
---
    public function addKeranjang($slug)
    {
        $produk = $this->produkModel->getProduk($slug);
        $produkId = $produk['id'];
        $userId = user_id();
        $keranjang = $this->keranjangModel->where(['barang_id' => $produkId, 'user_id' => $userId])->first();


        if ($keranjang) {
            $newJumlah = $keranjang['jumlah'] + 1;
            $this->keranjangModel->update($keranjang['id'], ['jumlah' => $newJumlah]);