app/Controllers/Keranjang.php

INSERT INTO `keranjang` (`user_id`, `barang_id`, `jumlah`) VALUES ('5', '27', 1)
---
    public function addKeranjang($slug)
    {
        $produk = $this->produkModel->getProduk($slug);
        $produkId = $produk['id'];
        $userId = user_id();

        $this->keranjangModel->save([
            'user_id' => $userId,
            'barang_id' => $produkId,
            'jumlah' => 1
        ]);